Revit 2027 API
UnitTypeId.Kilonewtons Property
 Kilonewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Kilonewtons { get; }
Public Shared ReadOnly Property Kilonewtons As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Kilonewtons {
	ForgeTypeId^ get ();
}
static member Kilonewtons : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace